package com.company;

public class Main {
    public static void main(String[] args) {
        Graph graph = new Graph();
        graph.print_tab();
        graph.dijkstra(1, 8);
        graph.dijkstra(1, 7);
        graph.dijkstra(1, null);
    }
}
/*
Примеры для тестирования.

Пример 1: Граф 14.4.6
Input:
8
1 2 23
1 3 12
1 4 0
1 5 0
1 6 0
1 7 0
1 8 0
2 3 25
2 4 0
2 5 22
2 6 0
2 7 0
2 8 35
3 4 18
3 5 0
3 6 0
3 7 0
3 8 0
4 5 0
4 6 20
4 7 0
4 8 0
5 6 23
5 7 14
5 8 0
6 7 24
6 8 0
7 8 16
Output:
	1	2	3	4	5	6	7	8
1	0	23	12	0	0	0	0	0
2	23	0	25	0	22	0	0	35
3	12	25	0	18	0	0	0	0
4	0	0	18	0	0	20	0	0
5	0	22	0	0	0	23	14	0
6	0	0	0	20	23	0	24	0
7	0	0	0	0	14	24	0	16
8	0	35	0	0	0	0	16	0
Кратчайшие пути от 1 элемента: 0	23	12	30	45	68	59	58
Кратчайший путь: 1 -> 2 -> 8
Кратчайшие пути от 1 элемента: 0	23	12	30	45	68	59	58
Кратчайший путь: 1 -> 2 -> 5 -> 7
Кратчайшие пути от 1 элемента: 0	23	12	30	45	68	59	58	

Пример 2:
4
1 2 5
1 3 6
1 4 7
2 3 8
2 4 9
3 4 10

Пример 3:
6
1 2 7
1 3 9
1 4 0
1 5 0
1 6 14
2 3 10
2 4 15
2 5 0
2 6 0
3 4 11
3 5 0
3 6 2
4 5 6
4 6 0
5 6 9
*/